#pragma once

#include <string>
#include <fstream>
#include <string>

const int NAME{75};

std::string randomingName(int number)
{
    setlocale(0, "");
    std::string names[75] = { "Саша", "Паша", "Даша", "Коля", "Оля",
                                "Юра", "Семен", "Артем", "Петя", "Лена",
                                "Харитон","Артемий","Елисей","Александр",
                                "Дмитрий","Виктор","Изяслав","Ярослав","Ростислав","Фадей","Богдан","Сергей",
                                "Пахом","Вадим","Макар","Марк","Митофан","Остап","Потап","Прохор","Радислав",
                                "Андрей","Артем","Олег","Валерий","Виталий","Владимир","Влас",
                                "Вячеслав","Геннадий","Георгий","Герман","Глеб","Григорий","Давид","Данила","Дементий",
                                "Дмитрий","Денис","Евгений","Евдоким","Егор","Евстафий",
                                "Елисей","Емельян","Игорь","Игнатий","Захар","Измаил","Илья","Иннокентий","Иосиф","Карл","Кирилл",
                                "Константин","Ян","Якуб","Юрий","Фома",
                                "Тимофей","Тимур","Тимур","Тихон","Ульян","Федор" };

    return names[number];
}